In [2]:
import pandas as pd

In [3]:
# Criando um vetor 

data = [0.5, None, None, 0.52, 0.54, None, None, 0.59, 0.6, None, 0.7]

In [4]:
# Criando uma séries

s = pd.Series(data)

In [5]:
# Preenchendo os dados faltantes com o valor da observação não nula, começando de cima para baixo

s.fillna(method = "ffill")

0     0.50
1     0.50
2     0.50
3     0.52
4     0.54
5     0.54
6     0.54
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [6]:
# Preenchendo os dados faltantes com o valor da observação não nula, começando de baixo para cima

s.fillna(method = "bfill")

0     0.50
1     0.52
2     0.52
3     0.52
4     0.54
5     0.59
6     0.59
7     0.59
8     0.60
9     0.70
10    0.70
dtype: float64

In [7]:
# Preenchendo os dados faltantes com as médias das obervações

s.fillna(s.mean())

0     0.500
1     0.575
2     0.575
3     0.520
4     0.540
5     0.575
6     0.575
7     0.590
8     0.600
9     0.575
10    0.700
dtype: float64

## Exercício

In [8]:
atletas = pd.DataFrame([["Marcos", 9.62], ["Pedro", None],
                        ["João", 9.69], ["Beto", 9.72],
                        ["Sandro", None], ["Denis", 9.69],
                        ["Ary", None], ["Carlos, 9.74"]],
                        columns = ["Corredor", "Melhor Tempo"])
atletas

       Corredor  Melhor Tempo
0        Marcos          9.62
1         Pedro           NaN
2          João          9.69
3          Beto          9.72
4        Sandro           NaN
5         Denis          9.69
6           Ary           NaN
7  Carlos, 9.74           NaN

In [9]:
atletas.fillna(atletas["Melhor Tempo"].mean(), inplace = True)

In [10]:
atletas

       Corredor  Melhor Tempo
0        Marcos          9.62
1         Pedro          9.68
2          João          9.69
3          Beto          9.72
4        Sandro          9.68
5         Denis          9.69
6           Ary          9.68
7  Carlos, 9.74          9.68